[
    {
        "name": "Digital Travel Map",
        "shortDesc": "Mark your travels on this map and save them to your browser!",
        "longDesc": "This small program lets you place different markers on the map commemorating your travels across the U.S. Once you've placed your locations on the map, you don't have to worry about losing your data; it automatically saves your markers inside your web browser! This program also allows you to download any markers you placed on the map into a .txt file and import it into a different browser, so you're not stuck with just one browser, or you realize the one you're using isn't compatible with saving browser data",
        "technologies": "HTML5, CSS3, JavaScript, Google Maps API, IndexedDB, JSON",
        "imageUrls": [
            "../assets/imgs/ustravelmap.PNG",
            "../assets/imgs/ustravelmap1.PNG",
            "../assets/imgs/ustravelmap2.PNG"
        ],
        "gitLink": "https://github.com/zeggleto/TravelMap",
        "projLink": "../assets/projects/Travel Map/pMap.html"
    },
    {
        "name": "Personal Website",
        "shortDesc": "What you're seeing right now",
        "longDesc": "This is my current website, built using Angular. I use it to relay my information to other people and share/store some of the little projects I've created",
        "technologies": "Angular, HTML5, CSS, TypeScript, BootStrap, JSON",
        "imageUrls": [
            "../assets/imgs/angularwebsite.PNG",
            "../assets/imgs/angularwebsite1.PNG",
            "../assets/imgs/angularwebsite2.PNG"
        ],
        "gitLink": "https://github.com/zeggleto/Eggsite",
        "projLink": "https://zacheggleton.com"
    },
    {
        "name": "AngularJS Website",
        "shortDesc": "Yes, it's black and white. My mind couldn't build cool color formations, so I just gave up",
        "longDesc": "This is my first website I created using basic AngularJS. I built it from scratch so I could understand web hosting a lot better and use the front-end skills I've been saving for a while. I want it to work on both mobile and desktops, so I used Bootstrap in it, and I wanted to keep it to just one page, so I used AngularJS as well.",
        "technologies": "HTML5, CSS3, JavaScript, Bootstrap, AngularJS, PHP",
        "imageUrls": [
            "../assets/imgs/thiswebsite.PNG",
            "../assets/imgs/thiswebsite2.PNG"
        ],
        "gitLink": "https://github.com/zeggleto/zacheggleton.github.io",
        "projLink": "https://zeggleto.github.io/zacheggleton.github.io/"
    },
    {
        "name": "U.S. Rent Map",
        "shortDesc": "Median rent for hundreds of U.S. cities mapped out",
        "longDesc": "This project consists of a web scraper to gather the rent data, a Flask server to deliver the data to the webpage, and the google maps page itself. The version you'll see when you click on 'View Project' is just the page getting the data from a .txt file, no scraper or Flask server; those parts are on my github page. The data used to populate this map was scraped from https://www.apartmentlist.com/rentonomics/national-rent-data/.",
        "technologies": "Python3, BeautifulSoup, Flask, Google Maps API, HTML5, CSS3, Javascript",
        "imageUrls": [
            "../assets/imgs/usrentmap.PNG",
            "../assets/imgs/usrentmap1.PNG",
            "../assets/imgs/usrentmap2.PNG"
        ],
        "gitLink": "https://github.com/zeggleto/USRentMap",
        "projLink": "../assets/projects/US Rent Map/index.html"
    },
    {
        "name": "Weather Comparer",
        "shortDesc": "Too hot or cold where you're at? Other places probably have it worse than you!",
        "longDesc": "A simple Python Kivy GUI that gets info from a Flask Server. The server grabs weather data from OpenWeatherAPI for a select number of cities from around the U.S., and compares it to your local weather. The GUI itself grabs the info from the Flask Application and displays to the user. The server updates it's weather every 10 minutes, while the GUI updates every 11 minutes. User can switch between hot and cold places as well. The application was designed to be used with the Raspberry Pi, but can work on most desktop environments",
        "technologies": "Python3, Flask, Kivy, OpenWeatherAPI",
        "imageUrls": [
            "../assets/imgs/weathercompare.PNG"
        ],
        "gitLink": "https://github.com/zeggleto/WeatherServer"
    },
    {
        "name": "Bomb Finder",
        "shortDesc": "This is just a knockoff of Minesweeper (honestly more of a direct ripoff).",
        "longDesc": "This is a simple C# Windows Form application that plays the game Bomb Finder (may or may not be similar to something else). Just run the game from the same folder as the corresponding .dll file it came with.",
        "technologies": "C#, .NET Windows Forms App",
        "imageUrls": [
            "../assets/imgs/bombfinder.PNG",
            "../assets/imgs/bombfinder1.PNG",
            "../assets/imgs/bombfinder2.PNG"
        ],
        "gitLink": "https://github.com/zeggleto/BombFinder",
        "projLink": "../assets/projects/BombFinder.zip"
    }
]